# FabricSheetTypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..FabricSheetTypeId Property
FabricArea Class See Also
---
The id of the Fabric Sheet Type for this element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId FabricSheetTypeId { get; set; }
```

Visual Basic
---
```text
Public Property FabricSheetTypeId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ FabricSheetTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Remarks
Changing the value of this property causes change of MinorLapSplice and MajorLapSplice properties if needed
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: fabricSheetTypeId is not a Fabric Sheet Type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace